# Pandas OverView

In [168]:
# importing pandas
import pandas as pd

In [169]:
print(pd.__version__)

0.25.1

In [170]:
# converting tuples in to a pandas series
tuples = ('Google' , '2020' , 100 , 10.2)
tp=pd.Series(tuples)
type(tp)

pandas.core.series.Series

In [171]:
print(tp)

0    Google
1      2020
2       100
3      10.2
dtype: object

In [172]:
# converting python list in to a pandas series
lists = ['IBM' , '1632' , 120 , 14.2]
ls=pd.Series(lists)
type(ls)

pandas.core.series.Series

In [173]:
print(ls)

0     IBM
1    1632
2     120
3    14.2
dtype: object

In [174]:
# converting python dict to a pandas series
dicts = {'name':'Google' , 'Year' : '2000' , 'Shares':100  , 'price':10.2}
dic=pd.Series(dicts)
print(type(dic))

<class 'pandas.core.series.Series'>

In [175]:
print(dic)

name      Google
Year        2000
Shares       100
price       10.2
dtype: object

In [176]:
# changing the custom index of a list
ls_index=pd.Series(lists , index = ['Name' , 'Year' , 'Shares' , 'Price'])
print(ls_index)

Name       IBM
Year      1632
Shares     120
Price     14.2
dtype: object

In [177]:
# changing the custom index of a tuple
tp_index = pd.Series(tuples , index = ['Name' , 'Year' , 'Sahres' , 'Price'])
print(tp_index)

Name      Google
Year        2020
Sahres       100
Price       10.2
dtype: object

In [178]:
# another way of changing the custom index
index = ['Name' , 'Year' , 'Shares' , 'Price']
ls_index= pd.Series(lists , index = index)
ls_tuple = pd.Series(tuples , index = index)
print(ls_index)
print(ls_tuple)

Name       IBM
Year      1632
Shares     120
Price     14.2
dtype: object
Name      Google
Year        2020
Shares       100
Price       10.2
dtype: object

In [179]:
# Accessing a single element using the custom name or the new_name
print(ls_index['Name'] , ls_tuple['Year'])
print(ls_index[0] , ls_tuple[1])

IBM 2020
IBM 2020

In [180]:
# Accessing multiple elements at a time
print(ls_index[['Name' , 'Year']])

Name     IBM
Year    1632
dtype: object

In [181]:
# slicing elements
ls_index[0:3]

Name       IBM
Year      1632
Shares     120
dtype: object

In [182]:
ls_tuple[:-1]

Name      Google
Year        2020
Shares       100
dtype: object

# DataFrame

In [183]:
import numpy as np
data = {
    'name': ['Google' , 'IBM' , 'Microsoft' , 'Facebook'] , 
    'Year': ['2020' , np.nan, '2018' , '2017'] ,
    'Shares' :[10 , 12 , 30, 14] , 
    'Net_Worth ': [100 , np.nan , 140 , 80] 
}
df=pd.DataFrame(data)
df

        name  Year  Shares  Net_Worth
0     Google  2020    10.0       100.0
1        IBM   NaN    12.0         NaN
2  Microsoft  2018     NaN       140.0
3   Facebook  2017    14.0        80.0

In [184]:
# Adding a new column
df['Owner'] = ['Biruk' , 'Solomon' , 'Bill Gates' , 'MarkZuckerburg']
df

        name  Year  Shares  Net_Worth            Owner
0     Google  2020    10.0       100.0           Biruk
1        IBM   NaN    12.0         NaN         Solomon
2  Microsoft  2018     NaN       140.0      Bill Gates
3   Facebook  2017    14.0        80.0  MarkZuckerburg

In [185]:
# changing the custom index
df.index= ['one' , 'Two' , 'Three' , 'Four']
df

            name  Year  Shares  Net_Worth            Owner
one       Google  2020    10.0       100.0           Biruk
Two          IBM   NaN    12.0         NaN         Solomon
Three  Microsoft  2018     NaN       140.0      Bill Gates
Four    Facebook  2017    14.0        80.0  MarkZuckerburg

In [186]:
# we can make a column as our index
col_index=df.set_index(['name'])
col_index

           Year  Shares  Net_Worth            Owner
name
Google     2020    10.0       100.0           Biruk
IBM         NaN    12.0         NaN         Solomon
Microsoft  2018     NaN       140.0      Bill Gates
Facebook   2017    14.0        80.0  MarkZuckerburg

In [187]:
# Accessing elements , column index
df['name']

one         Google
Two            IBM
Three    Microsoft
Four      Facebook
Name: name, dtype: object

In [188]:
# accessing more than one columns at a time
df[['name' , 'Owner']]

            name           Owner
one       Google           Biruk
Two          IBM         Solomon
Three  Microsoft      Bill Gates
Four    Facebook  MarkZuckerburg

In [189]:
# row element accessing 
df.loc['one']

name          Google
Year            2020
Shares            10
Net_Worth        100
Owner          Biruk
Name: one, dtype: object

In [190]:
# accesing the row element of a given column
df.ix[ : , 'name']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

one         Google
Two            IBM
Three    Microsoft
Four      Facebook
Name: name, dtype: object

In [191]:
# accessingg asingle element
df.ix[0 , 'name']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

'Google'

In [192]:
# deleting a column
del df['Shares'] # del used only for a column
df

            name  Year  Net_Worth            Owner
one       Google  2020       100.0           Biruk
Two          IBM   NaN         NaN         Solomon
Three  Microsoft  2018       140.0      Bill Gates
Four    Facebook  2017        80.0  MarkZuckerburg

In [193]:
# delting a row or a column using a drop method
df.drop('name' , axis  = 1)

       Year  Net_Worth            Owner
one    2020       100.0           Biruk
Two     NaN         NaN         Solomon
Three  2018       140.0      Bill Gates
Four   2017        80.0  MarkZuckerburg

In [194]:
# droping rows 
df.drop('one' , axis = 0)

            name  Year  Net_Worth            Owner
Two          IBM   NaN         NaN         Solomon
Three  Microsoft  2018       140.0      Bill Gates
Four    Facebook  2017        80.0  MarkZuckerburg

In [195]:
df.isnull()

        name   Year  Net_Worth   Owner
one    False  False       False  False
Two    False   True        True  False
Three  False  False       False  False
Four   False  False       False  False

In [196]:
df.notnull()

       name   Year  Net_Worth   Owner
one    True   True        True   True
Two    True  False       False   True
Three  True   True        True   True
Four   True   True        True   True

In [204]:
# what are the soloutions when we clean datas
# 1) Removing the Empty observations
# 2) Removing the Features who has empty observations
# 3) Filling The Empty datas with the mean , the median or zero

In [206]:
# 1) Removing The Empty observations
droping_observations=df.dropna(subset = ['Year'])
print(droping_observations)

            name  Year  Net_Worth            Owner
one       Google  2020       100.0           Biruk
Three  Microsoft  2018       140.0      Bill Gates
Four    Facebook  2017        80.0  MarkZuckerburg

In [208]:
droping_features =  df.drop('Year' , axis = 1)
droping_features

            name  Net_Worth            Owner
one       Google       100.0           Biruk
Two          IBM         NaN         Solomon
Three  Microsoft       140.0      Bill Gates
Four    Facebook        80.0  MarkZuckerburg

In [215]:
# 3) Filling the datas with the mean , median , or Zero
year_median=df['Year'].median()
filling_median = df['Year'].fillna(year_median)
print(filling_median)

one      2020
Two      2018
Three    2018
Four     2017
Name: Year, dtype: object

In [216]:
# filling by zero
filling_zero=df['Year'].fillna(0)
print(filling_zero)

one      2020
Two         0
Three    2018
Four     2017
Name: Year, dtype: object